# StartSetBack Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SweptProfile..::..StartSetBack Property
SweptProfile Class See Also
---
The distance from the start of the driving curve to the point where the sweep actually begins.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double StartSetBack { get; }
```

Visual Basic
---
```text
Public ReadOnly Property StartSetBack As Double
	Get
```

Visual C++
---
```text
public:
property double StartSetBack {
	double get ();
}
```

# See Also
SweptProfile Class
Autodesk.Revit.DB Namespace